//CWEZXXXX JOB (MMC),'PL/I SAMPLE',CLASS=L,
//  MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=&USERID
//*
//*JOBPARM S=CWCC
//*
//*   EXECUTE CWXTPLI IN BATCH
//*
//CWXTPLI  EXEC PGM=CWXTPLI,PARM='/00003'
//*
//STEPLIB  DD  DISP=SHR,DSN=CWEZ.TXXX.PRD.LOAD
//*
//EMPFILE  DD  DISP=SHR,DSN=SYS2.CW.&CWGAXT..SLXTSAMP(CWXTDATA)
//RPTFILE  DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//