//CWEZXXXX JOB (MMC),'C/370 SAMPLE',CLASS=L,
//  MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=&USERID
//*
//*JOBPARM S=CWCC
//*
//*   EXECUTE CWXTMAIN IN BATCH
//*
//CWXTMAIN EXEC PGM=CWXTMAIN,PARM=00003
//*
//STEPLIB  DD  DISP=SHR,DSN=CWEZ.#APP.PRD.LOAD
//*
//EMPFILE  DD  DISP=SHR,DSN=SYS2.CW.&CWGAXT..SLXTSAMP(CWXTDATA)
//RPTFILE  DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//